# 选择题
# 1、如果你想创建变量name，用来存储老师的名字：张老师,下列选项正确的是（C）
# A、name='"张老师"
# B、name=张老师
# C、name="张老师"
# D、name='张老师''

# 2、以下不合法的变量名是（D）
# A、name
# B、apple_price
# C、num
# D、*age

# 3、 已知name="zhang san",num=3,则print(name*num)显示结果是（C）
# A、zhang san*3
# B、zhang san zhang san zhang san
# C、zhang sanzhang sanzhang san
# D、代码有误不能运行

# 填空题
# 1、如果将True + False1 输出，结果是多少（1）。 将False1改成False 不然会报错未定义False1变量···
# -----------------------------------------------------------------------

# 2、数值类型有几种（整型int，浮点型float，字符串型str），查看数据类型的函数是（type()）。
# -----------------------------------------------------------------------

# 3、字符串有哪三种定义方式（）。
# 1.单引号定义: '字符串'
# 2.双引号定义："字符串"
# 3.三对单双引号定义:'''字符串''' or """字符串"""
# -----------------------------------------------------------------------
# 代码题
# 1、如何把"hello"和"world"拼接到一块输出（要求使用到变量）？
# 方案1
a = "helloworld"
print(a)
# 方案2
a = "hello"
b = "world"
print(a + b)
# 2、艾伦年纪25岁，她的职业是医生。请用% 格式化输出艾伦的姓名和年龄、职业。
name = "艾伦"
age = 25
job = "医生"
print("姓名：%s\n年龄：%d\n职业：%s\n" % (name, age, job))


# 3、小明在打印店打印两本课后练习册，数学练习册有78页，语文练习册有87页。数学练习册需要打印3份，语文练习册需要打印5份。
# 请编写一个程序，计算一共需要打印多少页?（要求使用到f-string格式化输出，并且程序中至少设置两个变量）

math_workbook = 78
chinese_workbook = 87
print(f"一共需要打印：{math_workbook*3 + chinese_workbook*5}页")
